#Дано ціле число N, яке користувач заповнює з клавіатури, для цього числа необхідно зробити такі перевірки:
#Якщо N непарне число, виведіть на екран "Weird"
#Якщо N парне число і входить у діапазон від 2 до 5 (включно), виведіть "Not Weird"
#Якщо N парне число і входить у діапазон від 6 до 20 (включно), виведіть "Weird"
#Якщо N непарне число і більше 20 , виведіть "Not Weird"


n = int(input('Введіть число n: '))

if n % 2 != 0:
   print('Weird')

if n % 2 == 0:
    if n > 2 or n < 5:
       print('No Weird')

if n % 2 == 0:
    if n > 6 or n > 20:
        print('Weird')

if n % 2 != 0:
    if n > 20:
     print('NO Weird')
